// Задача 3. Константность: найди ошибки
/*
Условие. Дан фрагмент кода.
Найдите все ошибки компиляции, связанные с const, и объясните,
почему они возникают.
Исправьте код минимальным образом.
*/

int main() {
    int x = 42;
    const int cx = 13;

    int& r1 = x;          // (1)
    const int& r2 = x;    // (2)
    const int& r3 = cx;   // (3)

    int* p1 = &x;         // (4)
    const int* p2 = &x;   // (5)
    int* p3 = &cx;        // (6)
    const int* p4 = &cx;  // (7)

    *p2 = 10;             // (8)
    p2 = &cx;             // (9)

    int* const p5 = &x;   // (10)
    p5 = nullptr;         // (11)

    return 0;
}