// Задача 2. «Ограбление домов» (House Robber) Тема: 1D ДП, оптимизация памяти.

// Условие: Вы — грабитель, планирующий ограбление домов на улице.В каждом доме i лежит nums[i] денег. 
// Единственное ограничение: нельзя грабить два соседних дома (сработает сигнализация).Найдите максимальную сумму, которую можно украсть.

// Примеры:
// [1, 2, 3, 1]      → 4   (грабим дома 0 и 2: 1 + 3 = 4)
// [2, 7, 9, 3, 1]   → 12  (грабим дома 1 и 3: 7 + 3 = 10? нет, 2+9+1 = 12)
// [5]               → 5
// [2, 1]            → 2   (грабим более дорогой дом)
// [2, 7, 9, 3, 1]   → 12  (2 + 9 + 1)
// []                → 0

// Разбор по четырём шагам ДП:
// Состояние: DP[i] — максимальная сумма, которую можно украсть из первых i домов.
// Рекуррентность: рассматриваем последний (i-й) дом:
// - Не грабим дом i-1: ответ = DP[i-1].
// - Грабим дом i-1: тогда дом i-2 грабить нельзя, ответ = nums[i-1] + DP[i-2].
// Итого: DP[i] = max(DP[i-1], nums[i-1] + DP[i-2]).
// Порядок: по возрастанию
// Ответ: DP[n].

#include <iostream>
#include <vector>
using namespace std;
int robHouse(const vector<int>& nums) {
    int n = nums.size();
    if (nums.size() == 0) return 0;
    if (nums.size() == 1) return nums[0];

    vector<int> DP(n + 1);

    DP[0] = 0;
    DP[1] = nums[0]; 

    for (int i = 2; i <= n; i++) {
        DP[i] = max(DP[i-1], nums[i-1] + DP[i-2]);
    }
    return DP[n]; 
}

int main() {
    cout << robHouse({1, 2, 3, 1}) << endl;       // 4
    cout << robHouse({2, 7, 9, 3, 1}) << endl;    // 12
    cout << robHouse({5}) << endl;                // 5
    cout << robHouse({2, 1}) << endl;             // 2
    cout << robHouse({}) << endl;                 // 0
    return 0;
}


